“The Instacart Online Grocery Shopping Dataset 2017”, Accessed from https://www.instacart.com/datasets/grocery-shopping-2017 on Sep 16, 2019

In [1]:
import numpy as np
import pandas as pd

In [2]:
#I don't need all this data. I'm commenting out the stuff I'm not using
#aisles=pd.read_csv('instacart_2017_05_01/aisles.csv')
#departments=pd.read_csv('instacart_2017_05_01/departments.csv')
order_products1=pd.read_csv('instacart_2017_05_01/order_products__prior.csv')
order_products2=pd.read_csv('instacart_2017_05_01/order_products__train.csv')
orders=pd.read_csv('instacart_2017_05_01/orders.csv')
#products=pd.read_csv('instacart_2017_05_01/products.csv')

In [3]:
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [4]:
order_products=pd.concat([order_products1, order_products2])

In [5]:
order_products.drop('reordered',axis=1,inplace=True)

In [6]:
orders.drop(['user_id','eval_set','order_number','days_since_prior_order'], axis=1, inplace=True)

In [7]:
#this is the Df that I'm going to do my predicting on. I still need to figure out how
#to create a feature that is the 'next item ordered. '
df=order_products.merge(orders, on='order_id')

In [8]:
order_products.head()

   order_id  product_id  add_to_cart_order
0         2       33120                  1
1         2       28985                  2
2         2        9327                  3
3         2       45918                  4
4         2       30035                  5

In [9]:
orders.head()

   order_id  order_dow  order_hour_of_day
0   2539329          2                  8
1   2398795          3                  7
2    473747          3                 12
3   2254736          4                  7
4    431534          4                 15

In [10]:
df.head(10)

   order_id  product_id  add_to_cart_order  order_dow  order_hour_of_day
0         2       33120                  1          5                  9
1         2       28985                  2          5                  9
2         2        9327                  3          5                  9
3         2       45918                  4          5                  9
4         2       30035                  5          5                  9
5         2       17794                  6          5                  9
6         2       40141                  7          5                  9
7         2        1819                  8          5                  9
8         2       43668                  9          5                  9
9         3       33754                  1          5                 17

In [11]:
#this code is slow and long. Vishnu gave me a way around it
def getNext(data):
    order_id=data[0]
    nextItem=data[1]+1
    orderContent=df[df['order_id']==order_id]
    Item=orderContent.loc[orderContent['add_to_cart_order']==nextItem, 'product_id']
    try:
        return int(Item)
    except:
        return np.NaN

In [16]:
getNext([4,2])

39758

df['NextOrder']=df[['order_id','add_to_cart_order']].apply(getNext, axis=1)

In [21]:
df['nextItem']=df.groupby('order_id')['product_id'].shift(-1)

In [14]:
df.shape

(33819106, 5)

In [ ]:
df.to_csv(DataWithTarget)

In [15]:
df.head()

   order_id  product_id  add_to_cart_order  order_dow  order_hour_of_day
0         2       33120                  1          5                  9
1         2       28985                  2          5                  9
2         2        9327                  3          5                  9
3         2       45918                  4          5                  9
4         2       30035                  5          5                  9

In [13]:
subset=df.loc[0:1000]

In [14]:
subset[['order_id','add_to_cart_order']].apply(getNext, axis=1)

0       28985.0
1        9327.0
2       45918.0
3       30035.0
4       17794.0
5       40141.0
6        1819.0
7       43668.0
8           NaN
9       24838.0
10      17704.0
11      21903.0
12      17668.0
13      46667.0
14      17461.0
15      32665.0
16          NaN
17      26434.0
18      39758.0
19      27761.0
20      10054.0
21      21351.0
22      22598.0
23      34862.0
24      40285.0
25      17616.0
26      25146.0
27      32645.0
28      41276.0
29          NaN
         ...
971     38381.0
972      7751.0
973     42383.0
974      5212.0
975     13708.0
976         NaN
977      8195.0
978     25146.0
979      7948.0
980      4715.0
981     10616.0
982     49478.0
983     18848.0
984     26165.0
985     14131.0
986     19076.0
987     35871.0
988     49056.0
989     31555.0
990     22894.0
991     37751.0
992     42240.0
993     15452.0
994     33651.0
995     36066.0
996     40310.0
997         NaN
998     35951.0
999      9450.0
1000    26216.0
Length: 1001, dtype: float64

In [19]:
df.groupby('order_id')['product_id'].shift(-1)

0           28985.0
1            9327.0
2           45918.0
3           30035.0
4           17794.0
5           40141.0
6            1819.0
7           43668.0
8               NaN
9           24838.0
10          17704.0
11          21903.0
12          17668.0
13          46667.0
14          17461.0
15          32665.0
16              NaN
17          26434.0
18          39758.0
19          27761.0
20          10054.0
21          21351.0
22          22598.0
23          34862.0
24          40285.0
25          17616.0
26          25146.0
27          32645.0
28          41276.0
29              NaN
             ...
33819076       10.0
33819077     4493.0
33819078     7781.0
33819079        NaN
33819080    17706.0
33819081    33424.0
33819082    17299.0
33819083    26800.0
33819084    34243.0
33819085        NaN
33819086     9340.0
33819087    21709.0
33819088    16475.0
33819089    12432.0
33819090        NaN
33819091     4347.0
33819092    34466.0
33819093     6244.0
33819094     6858.0
33819095    30316.0
33819096    35578.0
33819097    32650.0
33819098        NaN
33819099    13565.0
33819100    14233.0
33819101    35548.0
33819102        NaN
33819103    16953.0
33819104     4724.0
33819105        NaN
Name: product_id, Length: 33819106, dtype: float64